<a href="https://colab.research.google.com/github/Mildredkulei7/Moringa_Prep_week4/blob/main/Copy_of_Data_Investigation_with_Pandas_II.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<font color="green">*To start working on this notebook, or any other notebook that we will use in the Moringa Data Science Course, we will need to save our own copy of it. We can do this by clicking File > Save a Copy in Drive. We will then be able to make edits to our own copy of this notebook.*</font>

# Data Investigation with Pandas II

## 1.0 Importing our Libraries

In [ ]:
# Importing the libraries we will need 

# Importing the pandas library
# 
import pandas as pd

# Importing the numpy library
#
import numpy as np

## 1.1 Reading the Dataset from our CSV file

This dataset contains trips taken by thousands of kenyans to and from Nairobi during the year 2018.

*   Dataset link for download or access: [Link](https://drive.google.com/a/moringaschool.com/file/d/1xe2sHapdeGo7bIaiG7UV0rjgQZ5U6OXv/view?usp=sharing)

In [ ]:
# Let's read the data from the CSV file and create the dataframe to be used
# 
bus_df = pd.read_csv("bus_travels.csv")
bus_df

      ride_id travel_date travel_time  ... travel_to car_type max_capacity
0         247  2018-05-07       07:06  ...   Nairobi      Bus           49
1         256  2018-05-06       11:08  ...   Nairobi  shuttle           11
2         275  2018-05-04       05:00  ...   Nairobi  shuttle           11
3         285  2018-05-04       09:10  ...   Nairobi  shuttle           11
4         286  2018-05-04       09:20  ...   Nairobi  shuttle           11
...       ...         ...         ...  ...       ...      ...          ...
1106    15336  2018-05-07       07:01  ...   Nairobi      Bus           49
1107    15337  2018-05-07       07:08  ...   Nairobi      Bus           49
1108    15338  2018-05-07       07:04  ...   Nairobi      Bus           49
1109    15339  2018-05-07       07:05  ...   Nairobi      Bus           49
1110    15344  2018-05-09       08:00  ...   Nairobi      Bus           49

[1111 rows x 7 columns]

## 1.2 Previewing our Dataset

In [ ]:
# Let's preview the first 10 rows of our data
# 
bus_df.head(10)

   ride_id travel_date travel_time travel_from travel_to car_type  max_capacity
0      247  2018-05-07       07:06       Kisii   Nairobi      Bus            49
1      256  2018-05-06       11:08       Kisii   Nairobi  shuttle            11
2      275  2018-05-04       05:00       Kisii   Nairobi  shuttle            11
3      285  2018-05-04       09:10       Kisii   Nairobi  shuttle            11
4      286  2018-05-04       09:20       Kisii   Nairobi  shuttle            11
5      287  2018-05-04       07:02       Kisii   Nairobi      Bus            49
6      288  2018-05-04       09:30       Kisii   Nairobi  shuttle            11
7      292  2018-05-04       19:03       Kisii   Nairobi      Bus            49
8      298  2018-05-04       09:00       Kisii   Nairobi  shuttle            11
9      302  2018-05-04       08:40       Kisii   Nairobi  shuttle            11

## 1.3 Accessing Information about our Dataset

In [ ]:
# Getting to know more about the dataset by accessing its information
#
bus_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1111 entries, 0 to 1110
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ride_id       1111 non-null   int64
 1   travel_date   1111 non-null   object
 2   travel_time   1111 non-null   object
 3   travel_from   1111 non-null   object
 4   travel_to     1111 non-null   object
 5   car_type      1111 non-null   object
 6   max_capacity  1111 non-null   int64
dtypes: int64(2), object(5)
memory usage: 60.9+ KB

## 1.4 Answering Questions

Let's answer the following questions with our dataset

In [ ]:
# Challenge 1
# How many trips were taken on the 22/04/18?
# 
df=bus_df[bus_df['travel_date'] == '2018-04-22']
df['travel_date'].value_counts()

2018-04-22    66
Name: travel_date, dtype: int64

In [ ]:
# Challenge 2
# Which type of vehicle travelled on 23/04/18 from Kisii to Nairobi at 7.15am?
#
car_df = bus_df[(bus_df['travel_date'] == '2018-04-23') & (bus_df['travel_from'] == 'Kisii') & (bus_df['travel_to'] == 'Nairobi') & (bus_df['travel_time'] == '07:15')] 
car_df

     ride_id travel_date travel_time  ... travel_to car_type max_capacity
497     5676  2018-04-23       07:15  ...   Nairobi  shuttle           11

[1 rows x 7 columns]

In [ ]:
# Challenge 3
# How many trips were made from Kisii to Nairobi?
# 
df=bus_df[(bus_df['travel_from'] == 'Kisii') & (bus_df['travel_to'] == 'Nairobi')]
df.value_counts()

ride_id  travel_date  travel_time  travel_from  travel_to  car_type  max_capacity
5782     2018-04-21   05:30        Kisii        Nairobi    shuttle   11              1
2363     2018-04-30   07:06        Kisii        Nairobi    Bus       49              1
2406     2018-04-30   11:08        Kisii        Nairobi    shuttle   11              1
2404     2018-04-30   11:04        Kisii        Nairobi    shuttle   11              1
2394     2018-04-30   07:09        Kisii        Nairobi    Bus       49              1
                                                                                    ..
5302     2018-04-26   06:40        Kisii        Nairobi    shuttle   11              1
5303     2018-04-26   06:30        Kisii        Nairobi    shuttle   11              1
5305     2018-04-26   06:20        Kisii        Nairobi    shuttle   11              1
5307     2018-04-26   07:03        Kisii        Nairobi    Bus       49              1
247      2018-05-07   07:06        Kisii        Nairobi    Bus       49              1
Length: 545, dtype: int64

545 trips where made from Kisii to Nairobi

In [ ]:
# Challenge 4
# How many trips were made by shuttle from Nairobi?
# 
df=bus_df[(bus_df['travel_from'] == 'Nairobi') & (bus_df['car_type'] == 'shuttle')]
df.value_counts()

Series([], dtype: int64)

There are no trips from Nairobi by shuttle.
All trips are made to nairobi and not from it.

In [ ]:
# Challenge 5
# How many trips were made by bus from Nairobi to Awendo?
# 
df=bus_df[(bus_df['travel_from'] == 'Nairobi') & (bus_df['travel_to'] == 'Awendo')]
df.value_counts()

Series([], dtype: int64)

There were no trips made from Nairobi to Awendo

In [ ]:
# Challenge 6
# Which was the most travelled from destination by bus?
# 
df=bus_df[bus_df['car_type'] == 'Bus']
df['travel_from'].value_counts()

Rongo        115
Kisii        110
Homa Bay      53
Awendo        44
Rodi          43
Migori        41
Nyachenge     34
Kehancha      32
Ndhiwa        29
Sirare        28
Mbita         25
Kijauri       17
Oyugis        12
Sori          10
Keroka         6
Name: travel_from, dtype: int64

Kisii was the most travelled from destination by Bus

In [ ]:
# Challenge 7
# Which was the most travelled to destination?
# 
bus_df.travel_to.value_counts()

Nairobi    1111
Name: travel_to, dtype: int64

In [ ]:
# Challenge 8
# Which was the most travelled destination by bus?
# 

df=bus_df[bus_df['car_type'] == 'Bus']
df.travel_to.value_counts()

Nairobi    599
Name: travel_to, dtype: int64

In [ ]:
# Challenge 9
# Which town did not have a departure by shuttle?
# 
trav_df=bus_df[bus_df['car_type'] != 'shuttle']
trav_df.travel_from.value_counts()

Rongo        115
Kisii        110
Homa Bay      53
Awendo        44
Rodi          43
Migori        41
Nyachenge     34
Kehancha      32
Ndhiwa        29
Sirare        28
Mbita         25
Kijauri       17
Oyugis        12
Sori          10
Keroka         6
Name: travel_from, dtype: int64

In [ ]:
# Challenge 10
# Which were the most 5 travelled to destinations?
# 
bus_df.travel_to.value_counts()

Nairobi    1111
Name: travel_to, dtype: int64

In [ ]:
# Challenge 11
# Which were the least 5 travelled to destinations?
bus_df.travel_to.value_counts()
#The destination was only Nairobi

Nairobi    1111
Name: travel_to, dtype: int64

In [ ]:
# Challenge 12
# If all shuttles travelled with full capacity, how many people travelled in shuttles from Kisii to Nairobi in the month of May?
#
df=bus_df[(bus_df['travel_from'] == 'Kisii') & (bus_df['travel_to'] == 'Nairobi') & (bus_df['travel_date'] < '2018-05-31') & (bus_df['travel_date'] >'2018-05-01')]
df['max_capacity'].sum()

2421

In [ ]:
bus_df.travel_date.value_counts()

2018-04-27    108
2018-05-01    108
2018-04-30     95
2018-04-25     94
2018-04-26     91
2018-05-03     89
2018-04-23     78
2018-05-02     75
2018-04-24     73
2018-04-22     66
2018-04-29     64
2018-05-04     59
2018-04-21     40
2018-04-28     39
2018-05-05     13
2018-05-06     12
2018-05-07      6
2018-05-09      1
Name: travel_date, dtype: int64

In [ ]:
# Challenge 13
# Which date had the highest no. of trips in June?
#
h_trip = bus_df[(bus_df['travel_date'] < '2018-06-31') & (bus_df['travel_date'] >'2018-06-01')]
h_trip.max()

ride_id        NaN
travel_date    NaN
travel_time    NaN
travel_from    NaN
travel_to      NaN
car_type       NaN
max_capacity   NaN
dtype: float64

In [ ]:
# Challenge 14
# On average, how many trips were made by all vehicles in a day?
#
date = bus_df['travel_date'].value_counts()
trips = date.sum()/date.count() 
trips

61.72222222222222

In [ ]:
# Challenge 15 
# On average, how many buses and shuttles travelled in a day?
# 
c_type = bus_df[(bus_df['car_type'] == 'Bus')] 
day = c_type['travel_date'].value_counts()
bus_trav_avg = day.sum()/day.count()
bus_trav_avg

33.27777777777778

In [ ]:
c_type = bus_df[(bus_df['car_type'] == 'shuttle')] 
day = c_type['travel_date'].value_counts()
bus_trav_avg = day.sum()/day.count()
bus_trav_avg

34.13333333333333

33.278 + 34.133 = 67.411

67.411/2 = 33.7055